'''
Напишите функцию, которая будет получать 2 числа и возвращать результат произведения этих чисел.

--------
assert mult_two(3, 2) == 6
assert mult_two(0, 1) == 0
'''

def mult_two(a, b):
    mult = a*b
    return mult
mult_two(3, 2)
print(mult_two(3, 2))
    #print('Mult_two1:', '=', a*b)
assert mult_two(3, 2) == 6
assert mult_two(0, 1) == 0













